Revit 2025 API
ExternalServices.BuiltInExternalServices.PlugInManagerUIService Property
 The UI service which permits registration of an external server for new PlugIn Manager UI.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static ExternalServiceId PlugInManagerUIService { get; }
Public Shared ReadOnly Property PlugInManagerUIService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ PlugInManagerUIService {
	ExternalServiceId^ get ();
}
static member PlugInManagerUIService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace